In [85]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings("ignore")

In [86]:
df=pd.read_csv("train.csv")[["Age","Pclass","SibSp","Parch","Survived"]]

In [87]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

- first we will train the data without any thing then check before and after accuracy score

In [88]:
df.dropna(inplace=True)

In [89]:
df.isnull().sum()

Age         0
Pclass      0
SibSp       0
Parch       0
Survived    0
dtype: int64

In [90]:
x=df.drop(columns=["Survived"])
y=df["Survived"]

In [91]:
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression

In [92]:
print("accuracy",np.mean(cross_val_score(LogisticRegression(),x,y,scoring="accuracy",cv=20)))
# accuracy without feature construction

accuracy 0.6933333333333332

# 1) Feature Construction

In [93]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [94]:
df["Family_size"]=df["SibSp"]+df["Parch"]+1

In [95]:
df.head()

    Age  Pclass  SibSp  Parch  Survived  Family_size
0  22.0       3      1      0         0            2
1  38.0       1      1      0         1            2
2  26.0       3      0      0         1            1
3  35.0       1      1      0         1            2
4  35.0       3      0      0         0            1

In [96]:
def family_type(size):
    if size == 1:
        return 0
        #small family
    if size > 1 and size <=4:
        return 1
        #medium family
    else:
        return 2

In [97]:
family_type(1)

0

In [98]:
df["Family_type"]=df["Family_size"].apply(family_type)

In [99]:
df.head()

    Age  Pclass  SibSp  Parch  Survived  Family_size  Family_type
0  22.0       3      1      0         0            2            1
1  38.0       1      1      0         1            2            1
2  26.0       3      0      0         1            1            0
3  35.0       1      1      0         1            2            1
4  35.0       3      0      0         0            1            0

In [100]:
new_df=df.drop(columns=["SibSp","Parch"])

In [101]:
new_df.head()

    Age  Pclass  Survived  Family_size  Family_type
0  22.0       3         0            2            1
1  38.0       1         1            2            1
2  26.0       3         1            1            0
3  35.0       1         1            2            1
4  35.0       3         0            1            0

In [102]:
x=new_df.drop(columns=["Survived"])
y=new_df["Survived"]

In [103]:
print("accuracy",np.mean(cross_val_score(LogisticRegression(),x,y,scoring="accuracy",cv=20)))
# so basically here we can see that the accuracy is improved

accuracy 0.7046428571428571

# 2) Feature Splitting

In [104]:
df=pd.read_csv("train.csv")
df.head()
# if we see in this data the name column has untidy data we can seperate it to improve the accuracy of model

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [105]:
df["Title"]=df["Name"].str.split(",",expand=True)[1].str.split(".",expand=True)[0]
# expand=True will split it in seperate columns

In [106]:
df["Title"]

0         Mr
1        Mrs
2       Miss
3        Mrs
4         Mr
       ...
886      Rev
887     Miss
888     Miss
889       Mr
890       Mr
Name: Title, Length: 891, dtype: object

In [107]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr

In [108]:
df[['Title','Name']]

     Title                                               Name
0       Mr                            Braund, Mr. Owen Harris
1      Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2     Miss                             Heikkinen, Miss. Laina
3      Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       Mr                           Allen, Mr. William Henry
..     ...                                                ...
886    Rev                              Montvila, Rev. Juozas
887   Miss                       Graham, Miss. Margaret Edith
888   Miss           Johnston, Miss. Catherine Helen "Carrie"
889     Mr                              Behr, Mr. Karl Howell
890     Mr                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [109]:
df.groupby('Title')['Survived'].mean().sort_values(ascending=False)

Title
the Countess    1.000000
Mlle            1.000000
Sir             1.000000
Ms              1.000000
Lady            1.000000
Mme             1.000000
Mrs             0.792000
Miss            0.697802
Master          0.575000
Col             0.500000
Major           0.500000
Dr              0.428571
Mr              0.156673
Jonkheer        0.000000
Rev             0.000000
Don             0.000000
Capt            0.000000
Name: Survived, dtype: float64

In [110]:
df['Is_Married'] = 0
df['Is_Married'].loc[df['Title'] == 'Mrs'] = 1

In [111]:
df['Is_Married']

0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    0
889    0
890    0
Name: Is_Married, Length: 891, dtype: int64